Tekla Open API Reference for Tekla Structures 2025
ArrowheadPositions Enumeration
 The positions of the arrowheads on the line.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum ArrowheadPositions
Public Enumeration ArrowheadPositions
Members
Member name | Value | Description
None | 0 |  No arrowheads on the line.
Start | 1 |  One arrowhead at the start of the line.
End | 2 |  One arrowhead at the end of the line.
Both | 3 |  Arrowheads at both ends of the line.
See Also
Reference
Tekla.Structures.Drawing Namespace